0day1day/esp32-c6-mini-MatrixLED/boards/MATRIXLED_C6/mpconfigboard.h
// Matrix LED: generic ESP32-C6 (4MiB+ flash), no Bluetooth.

#define MICROPY_HW_BOARD_NAME               "Matrix LED C6"
#define MICROPY_HW_MCU_NAME                 "ESP32C6"

#define MICROPY_HW_ENABLE_UART_REPL         (1)
